[
 [
  "b", 
  "if ron paul chose mitt romney as his VP I think that'd work...", 
  {
   "neg": 0.0, 
   "neu": 1.0, 
   "pos": 0.0, 
   "compound": 0.0
  }
 ], 
 [
  "c", 
  "No I'm saying they were successful popular movements.", 
  {
   "neg": 0.159, 
   "neu": 0.362, 
   "pos": 0.478, 
   "compound": 0.6597
  }
 ], 
 [
  "b", 
  "I'm going to guess you're in your 20s. This isn't a phenomenon independent only to the Obama presidency, you're just at an age that you're noticing it. It happened with the Bush's, Clinton, etc. The only difference I saw this time was some people *really* wanted to believe they had something different from every other politician. Especially following a particularly unpopular president. I think the amount of \"face-rubbing\" is going to be relatively proportional to the amount of gloating. No matter which party wins. ", 
  {
   "neg": 0.026, 
   "neu": 0.887, 
   "pos": 0.088, 
   "compound": 0.6486
  }
 ], 
 [
  "b", 
  "Yep, I'm in CT. I just wasn't sure if they did it mid-term. ", 
  {
   "neg": 0.139, 
   "neu": 0.706, 
   "pos": 0.155, 
   "compound": 0.0613
  }
 ], 
 [
  "c", 
  "Correct.", 
  {
   "neg": 0.0, 
   "neu": 1.0, 
   "pos": 0.0, 
   "compound": 0.0
  }
 ], 
 [
  "a", 
  "The fact that you keep referring to \"democrat\" when you mean \"republican.\"  It's okay that you are absolutely wrong.  It's a tricky subject.", 
  {
   "neg": 0.201, 
   "neu": 0.726, 
   "pos": 0.073, 
   "compound": -0.5198
  }
 ], 
 [
  "a", 
  "Probably one of the best defenses of the current status quo (which I disagree with) is that there is actually no discrimination going on, only perceived discrimination.  Nothing prevents a gay man from exercising the same right that a straight man has - both can marry a woman.  What the gay lobby is asking is for a creation of a new right, allowing a man to marry a man and a woman to marry a woman.  Not even straight people have those rights.\n\nThe difference is that the gay man is not attracted and has no interest in marrying a woman, but that is a matter of choice.  The logic here is that if we are extending the right to marry to anyone (as described above) then what justification is there to restrict based on other personal choices?  What if three men and two women want to be married as a single unit?\n\nNow, I find it compelling only because of the last argument.  Marriage should be a union between as many willing and consenting adults as they would like.  We have enough partnership law to use for divorce and arrangements, but would allow that to be superseded by pre- or post-nuptial agreements.  And if we are doing this for benefits and not on \"reproduction\" does the ban on incestuous marriage still make sense?  I love my sister more than many other people... if she needed health insurance, why couldn't we arrange a \"marriage\" so she could get it through my work?", 
  {
   "neg": 0.069, 
   "neu": 0.801, 
   "pos": 0.13, 
   "compound": 0.8791
  }
 ], 
 [
  "b", 
  "The best description might be authoritarian capitalist, but it is worth keeping in mind that China's government is heavily involved in the supposedly capitalist marketplace. Many big firms are outright owned by the government and the degree to which this is the case is debated.\n\nThe reason for the mixed messages is that the actual system is unclear.", 
  {
   "neg": 0.04, 
   "neu": 0.881, 
   "pos": 0.079, 
   "compound": 0.3506
  }
 ], 
 [
  "b", 
  "It is important to remember that there are many different rebel groups. We would not be arming all of them, but rather those that are most acceptable to us &amp; our allies/most conducive to a tolerant post-Assad Syria.", 
  {
   "neg": 0.031, 
   "neu": 0.791, 
   "pos": 0.178, 
   "compound": 0.7302
  }
 ], 
 [
  "a", 
  "Yes, it is.  \n\nIt's a pipeline that for all intents and purposes should be built (under existing law), but Obama is able to hold up based on the fact it crosses the border.  \n\nIt's a pipeline like the dozens if not hundreds of others that criss-cross our nation (and the world).  \n\nAnd it's a pipeline supported by a good chunk of his base (unions), and opposed by another (the environmentalists), which is why he has been sitting on it, refusing to either approve or reject.  He wouldn't put himself in a bad spot by doing either thing.  \n\nIt's a non-concession.  I wouldn't even go so far as to call it \"minor\".", 
  {
   "neg": 0.098, 
   "neu": 0.803, 
   "pos": 0.099, 
   "compound": -0.2382
  }
 ], 
 [
  "b", 
  "&gt; considering all the back-pay and waste that occurred due to the shutdown\n\nYou don't really think they care about that, do you? That would be moral.", 
  {
   "neg": 0.09, 
   "neu": 0.8, 
   "pos": 0.111, 
   "compound": 0.1689
  }
 ], 
 [
  "a", 
  "Riders have a benefit; they speed up bills getting passed by allowing them to combine multiple bills into one vote.\n\nI agree that sometimes controversial riders are added to other bills in an attempt to either sneak them through or cause the other bill to fail and that this is lame.\n\nHowever apparently politicians think the benefits outweigh the downsides.", 
  {
   "neg": 0.119, 
   "neu": 0.762, 
   "pos": 0.119, 
   "compound": 0.0
  }
 ], 
 [
  "b", 
  "No one can give you a non-biased explanation of socialism.", 
  {
   "neg": 0.216, 
   "neu": 0.784, 
   "pos": 0.0, 
   "compound": -0.296
  }
 ], 
 [
  "b", 
  "That is under the assumption that the single industry still exists. I agree that many cities, states, and even nations can survive on single industries, Hell Michigan in the early 1900's attests to that fact. However, GM is an 18th of what it once was in Michigan, and that is a generous figure. Plants (the ones that are still open) that used to run on 3,000 workers a day are now operating with 50 people. Bottom line is Michigan has to find a new industry but that is going to be hard to do with ghost towns, a broken infrastructure, ever growing crime, a collapsing school system, and an eviscerated tax base. They need a miracle. \n\nAnd like I said I'm not blaming either party. The Dems were in office when the economy collapsed and the Reps are in office now that they are trying to rebuild. As much as I hate Snyder he was given a turd to polish into gold. I don't care the banner of anyone's politics, there is no coming back from economic collapse on that scale, not quickly anyway. \n\nEdit: and for the \"not borrowing constantly bit\" Detroit and Michigan literally had no other option. You can't take a city with 2 million people, dwindle it down to 700,000, and think that those people are going to be able to support the city with 2/3rds of it's tax base missing. Even more if you consider the fact that the only people really left in Detroit are the poor. The tax base is more than likely to be closer to a 10th of what it once was. If Detroit didn't borrow to try and revive the city everyone would have had to just let the city fall into 3rd world conditions. Everyone would have had to have left. There wouldn't have been anyway to fund the police stations, fire stations, schools, trash pick-up, sewage, electricity, water infrastructure, public transportation,etc. etc. The only thing they can do now is destroy half the city, let nature retake it, and start over with what they have left. That is going to take an investment, and right now the state of Michigan isn't able afford the loans or the grants to do so. ", 
  {
   "neg": 0.138, 
   "neu": 0.797, 
   "pos": 0.064, 
   "compound": -0.986
  }
 ], 
 [
  "b", 
  "One of the examples used a situation where someone was rapidly dying and he called a doctor.  OP argued that because of the ethical distinction between harm via action and inaction, that the doctor would be doing nothing wrong if he let the person die because he didn't like the ethnic group the person belonged to.  As I understood it, he felt that because a doctor in such a situation is not technically \"harming\" the person then he should have the right to say \"instead of helping you I'm going to sit here and watch you bleed to death because you're [insert ethnic/religious/etc. group]\".", 
  {
   "neg": 0.154, 
   "neu": 0.776, 
   "pos": 0.069, 
   "compound": -0.8707
  }
 ], 
 [
  "a", 
  "&gt;No, it forces people to pay \n\nThe whole point is they get coverage without paying. I think you're confused how it actually works.", 
  {
   "neg": 0.156, 
   "neu": 0.844, 
   "pos": 0.0, 
   "compound": -0.4019
  }
 ], 
 [
  "b", 
  "Specifically, the referendum system in CA I think is a great case study for American Politics. Increases in benefits (e.g., school spending) easily passes while they also pass a hard cap on taxes (property taxes specifically). When people in CA are given the choice via referendums (obviously, they aren't given the choice on everything) they tend to choose lower taxes and higher benefits. Hence: huge debt.  \n\nedits: bad wordz choice and spelling", 
  {
   "neg": 0.115, 
   "neu": 0.718, 
   "pos": 0.167, 
   "compound": 0.6597
  }
 ], 
 [
  "a", 
  "These \"managed competition\" plans have been repeatedly tried in states and they always fail. Even with a mandate they fail because their risk pool tends to be sicker than the pool of employed people. Something called a death spiral occurs, the cost to the enrollees rises and the healthier people drop out, raising the price still more, eventually only the sickest remain, increasing the price still more. We absolutely cannot win with the insurance model. It can not be \"for profit\" and still be affordable.\n\nhttp://www.pnhp.org/resources/pnhp-research-the-case-for-a-national-health-program", 
  {
   "neg": 0.213, 
   "neu": 0.787, 
   "pos": 0.0, 
   "compound": -0.9631
  }
 ], 
 [
  "b", 
  "People outside the United States are not given the same constitutional protections.", 
  {
   "neg": 0.0, 
   "neu": 0.797, 
   "pos": 0.203, 
   "compound": 0.4215
  }
 ], 
 [
  "a", 
  "Its almost impossible to accurately compare costs in the US and abroad because the US does not have huge funding for universities as most European countries do.  The entire system is foundationally different.  \n\nNow, I think there are things about the European system that the US needs to adopt (for one, I think we have too many universities in the US and ironically not enough competition because of that), but to say it only cost you $6500 for five years is ignoring the taxes others are paying to subsidize that education.", 
  {
   "neg": 0.054, 
   "neu": 0.931, 
   "pos": 0.015, 
   "compound": -0.5692
  }
 ], 
 [
  "a", 
  "It's particularly galling to me because this is a subreddit where answers can't be as easily proven (there's a reason our theses have hundreds of footnotes and are 100+ pages).\n\nAuthority in a field of hard science or math is easier to back up because someone can usually check your work. But if you claim to be an accountant and you're really just a high school kid who likes economics, you lessen the value and trustworthiness of the sub when you lie (I'm not accusing AuditorTux, just to be clear. I'm using him as an example of someone who would be harmed by a lie).\n\nIf you claim to work in government but you were really just an intern (or you just watch a lot of West Wing) it does and it should give your answers less credence unless you're willing to source your statements in detail (which should be the bar if you don't have credentials). \n\nEspecially in a sub where people make claims of expert knowledge there's a general acceptance of certainty as a barometer for truth, it seems reasonable to call out those people who clearly are bullshitting the people who come here to learn about politics.", 
  {
   "neg": 0.023, 
   "neu": 0.858, 
   "pos": 0.119, 
   "compound": 0.9505
  }
 ], 
 [
  "b", 
  "The shutdown is caused because the prior appropriations bill (continuing resolution) expired, so the federal gov't is no longer authorized to spend money.  Therefore, revenues in the general fund will continue to sit there until spent pursuant to an appropriations bill (the next cr).  Obviously, a chunk of general fund revenues will have to be appropriated to pay back expenses that are currently not being paid due to the shutdown.  ", 
  {
   "neg": 0.051, 
   "neu": 0.949, 
   "pos": 0.0, 
   "compound": -0.3818
  }
 ], 
 [
  "b", 
  "/r/HomeworkHelp ", 
  {
   "neg": 0.0, 
   "neu": 1.0, 
   "pos": 0.0, 
   "compound": 0.0
  }
 ], 
 [
  "a", 
  "the cost of regulatory compliance in this country already runs to [2 trillion dollars](http://archive.sba.gov/advo/research/rs264tot.pdf) a year, nearly 8000 dollars per employee, and it disproportionately affects small employers.  pilling more on top of that won't make things better.", 
  {
   "neg": 0.063, 
   "neu": 0.883, 
   "pos": 0.054, 
   "compound": -0.0843
  }
 ], 
 [
  "c", 
  "Right, and it's in contrast to naturalized citizenship.\n\nETA: The generally understood goal is/was to prevent someone who happens to be  good politician from naturalizing and becoming president while still having greater ties to a foreign country", 
  {
   "neg": 0.0, 
   "neu": 0.835, 
   "pos": 0.165, 
   "compound": 0.6705
  }
 ], 
 [
  "a", 
  "I've been a delegate to several county conventions and one state convention, and I was active in my precinct in Dallas. And I've been a poll-watcher, off and on, for a couple of decades. But I've never had the *slightest* ambition to run for office.", 
  {
   "neg": 0.0, 
   "neu": 0.937, 
   "pos": 0.063, 
   "compound": 0.4019
  }
 ], 
 [
  "a", 
  "No.  Even if they miss the debt ceiling, it would be a while (few weeks, I think*) before the US actually defaults.  Even Boehner and his merry band of fools wouldn't let that happen.  I'd be shocked if they even let us hit the debt ceiling.  \n\n\\*Edit:  Maybe even longer since today is tax day for people filing extensions.  And that might not be included in the debt ceiling calculation since checks mailed today won't be processed by Thursday.  ", 
  {
   "neg": 0.188, 
   "neu": 0.773, 
   "pos": 0.039, 
   "compound": -0.8834
  }
 ], 
 [
  "b", 
  "As much as I love Super Dave Osborne, he's a sketch character (and funny as hell).  Everything is scripted and there isn't much actual risk.  Evel is dead because he was actually a stuntman.", 
  {
   "neg": 0.1, 
   "neu": 0.603, 
   "pos": 0.297, 
   "compound": 0.8183
  }
 ], 
 [
  "a", 
  "I don't write the laws. I just read 'em. And that's how I read it. ", 
  {
   "neg": 0.0, 
   "neu": 1.0, 
   "pos": 0.0, 
   "compound": 0.0
  }
 ], 
 [
  "a", 
  "Nowhere in my comement implies force towards Israel.  I meat just make a  a clear an public statement that Israel need to normalize its Atomic status.", 
  {
   "neg": 0.0, 
   "neu": 0.898, 
   "pos": 0.102, 
   "compound": 0.3818
  }
 ], 
 [
  "c", 
  "&gt; As a Democrat, I hope they hold this grudge forever\n\nI will drink to that, my friend.  ", 
  {
   "neg": 0.0, 
   "neu": 0.681, 
   "pos": 0.319, 
   "compound": 0.7269
  }
 ], 
 [
  "b", 
  "And if it ever passed and wound up in the Supreme Court, it would probably be struck down as unconstitutional. But as it stands now, bills that are signed into law are presumed constitutional until someone has standing to challenge their constitutionality.", 
  {
   "neg": 0.044, 
   "neu": 0.85, 
   "pos": 0.107, 
   "compound": 0.4404
  }
 ], 
 [
  "b", 
  "As a strong proponent of the current system, I'll bite.\n\nWe don't need voting system reform because the current system is the best for the needs of the United States. Single-Member District Plurality (also called First Past the Post) gives individual representatives the freedom to represent the interests of their district before the interests of their political parties. What basically happens is that coalitions between ideological factions happen before the elections instead of after them like other systems.\n\nProportional Representation systems (like Germany, Italy, and France) cause the country to be ruled unilaterally by a single ideological group that the majority of the country voted against. It also breeds political radicalism that tends to be contained by restricting freedom of speech. There are more ideological groups holding seats in the legislature, but only one dictating policy.\n\nAlternative voting methods like Instant-Runoff Voting or Cumulative Voting tend to create governments with the negative aspects of both SMDP and PR. They create larger third parties that are able to hold seats but not affect policy while the two main parties turn into ideological monoliths rather than the vague associations they are in SMDP. This causes a stagnant political atmosphere that polarizes the country.\n\nOne thing to always keep in mind is that between 10-20% of the population in most liberal democracies is bigoted xenophobic nationalists. In systems like the US, this demographic either doesn't vote or votes Republican and the party maybe throws out a few comments to pander to the voter base but ultimately doesn't dictate policy based on their ideology. In France, this bloc forms a political party called the National Front that has a significant influence on policy. It also drags the center-right party to adopt more radical stances to take their voters and keep the radical party's power down. In Germany, this group is repressed by restrictions on civil liberties and occasionally riots in the streets. Systems that favor centrism tend to work out better for the people living in them.\n\nThe problem with voting in the US is that people in the current generation never learned how to use the system. Since coalitions are formed prior to the elections, primary elections are extremely important in affecting policy. The Tea Party is an excellent case study in how to actually affect policy in the US. They did everything right, including forwarding candidates within the Republican party, making sure those candidates were elected via primary elections, and making incumbent Republicans pander to their ideology.\n\nI'll admit I'm a little intoxicated right now, so I might not have explained things completely. Feel free to ask for clarification on anything.", 
  {
   "neg": 0.042, 
   "neu": 0.782, 
   "pos": 0.176, 
   "compound": 0.9963
  }
 ], 
 [
  "b", 
  "The unusual aspect of this year's response was that the Tea Party (Rand Paul) felt it necessary to give a separate [response](http://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=4&amp;ved=0CEEQFjAD&amp;url=http%3A%2F%2Fwww.mediaite.com%2Ftv%2Fwatch-live-rand-paul-delivers-tea-party-response-to-state-of-the-union-2013%2F&amp;ei=2zscUa36DYSfiAKYg4C4BA&amp;usg=AFQjCNEeoBWyDGboQPuTyth2ImAREA9oFA&amp;bvm=bv.42452523,d.cGE]).\n\nThe GOP is disintegrating.", 
  {
   "neg": 0.0, 
   "neu": 0.899, 
   "pos": 0.101, 
   "compound": 0.4019
  }
 ], 
 [
  "c", 
  "excellent replies so far. i would echo that media consolidation and the ability for people to isolate themselves in partisan media and social bubbles are a main driving factor for this.\n\nas much as it saddens me, i see our citizens identifying less and less and \"american\" and more and more as ethnic, ideological, or regional identities. i fully expect parallel cultures to continue to form for these solidifying identities as well.", 
  {
   "neg": 0.062, 
   "neu": 0.831, 
   "pos": 0.107, 
   "compound": 0.5267
  }
 ], 
 [
  "a", 
  "down voted and ignored as straw man.", 
  {
   "neg": 0.277, 
   "neu": 0.723, 
   "pos": 0.0, 
   "compound": -0.3182
  }
 ], 
 [
  "b", 
  "The average SS benefit is $1,230/mo or $14,760/yr.  That seems like a good starting point to me, especially if you'd assume that single payer healthcare would come before guaranteed income, so you wouldn't have to pay health insurance out of that amount.  You'd probably want to put in some sort dependent allowance as well for families.  ", 
  {
   "neg": 0.0, 
   "neu": 0.789, 
   "pos": 0.211, 
   "compound": 0.8778
  }
 ]
]
